""" 题目描述
小蓝在一条长度为 20260606 的笔直轨道上放置了 2026 个巡检机器人。这条轨道可以看作一条数轴线段，左端点的位置为 0，右端点的位置为 20260606，第 i 个机器人初始位于位置 10000i，并贴有编号为 i 的标签。

为了测试这些机器人的巡检调度机制，小蓝启动了所有机器人。所有机器人同时开始移动，速度均为每秒 1 个单位长度。编号为奇数的机器人向左移动，编号为偶数的机器人向右移动。

在移动过程中，若两个机器人迎面碰到一起，它们会立即各自掉头，并以原来的速度继续移动。当某个机器人移动到位置 0 或位置 20260606 时，它会立即离开轨道，并不再参与后续移动。小蓝会按照机器人离开轨道的先后顺序，依次记录它们身上的标签编号。

现在请你计算，小蓝记录下的第 777 个标签编号是多少。

输入格式
无

输出格式
这是一道结果填空题，你只需要算出结果后提交即可。本题的结果为一个整数，在提交答案时只需编写一个程序输出这个整数，填写多余的内容将无法得分。

输入输出样例
输入 #1复制

输出 #1复制

 """
#第一个机器人到左边的距离是10000，最后一个机器人到右边的距离是606，
#所以最右边的机器人是第一个离开的
#模拟找规律，最后机器人到达的顺序应该是2026, 1, 2025, 2, 2024, 3, ……
#所以奇数个离开的机器人就是倒着数的，偶数个拉开的机器人就是正着数的
#777是一个奇数，所以就是倒着数，用2026减去一个数
#最后易得答案就是2026 - ((k-1)//2),若k为奇数
#偶数个离开的编号就是 k//2
ans = 2026 - ((777-1)//2)
print(ans)