""" 题目描述
某智能制造工厂拥有两条完全相同且可以并行工作的自动化生产线，分别记为 A 和 B。现在，工厂同时接到了 N 份生产订单。

对于第 i 份订单（1≤i≤N），给定以下三个参数：

加工时间 p 
i
​
 ：该订单在任意一条生产线上加工所需的时间；
交付期限 d 
i
​
 ：该订单必须在第 d 
i
​
  小时之前（含第 d 
i
​
  小时）完成；
订单收益 r 
i
​
 ：若该订单按时完成，工厂可以获得的收益。
两条生产线都从第 0 小时开始运行，并且彼此独立。对于任意一条生产线：

同一时刻最多只能加工一份订单；
每份订单一旦开始加工，就必须连续完成，不能中断；
相邻订单之间没有切换时间。
工厂可以从这 N 份订单中选择任意若干份进行生产。对于每一份被选择的订单，需要决定：

将其分配给生产线 A 或生产线 B；
它在对应生产线上的加工顺序。
要求所有被选择的订单都必须在各自的交付期限内完成。对此，请你计算：工厂最多能够获得多少收益。

输入格式
第一行包含一个正整数 N，表示订单数量。

接下来 N 行，每行包含三个正整数 p 
i
​
 ,d 
i
​
 ,r 
i
​
 ，分别表示第 i 份订单的加工时间、交付期限和收益。

输出格式
输出一行，包含一个整数，表示能够获得的最大总收益。

输入输出样例
输入 #1复制

4
3 4 10
3 5 12
2 3 6
4 7 15
输出 #1复制

43
输入 #2复制

5
3 4 10
2 3 7
4 6 20
3 7 12
5 8 18
输出 #2复制

60
说明/提示
【样例说明 1】
四份订单的信息如下：

订单编号	1	2	3	4
加工时间 p 
i
​
 	3	3	2	4
交付期限 d 
i
​
 	4	5	3	7
收益 r 
i
​
 	10	12	6	15
一种最优安排如下：

生产线 A：先加工订单 3，再加工订单 2；
生产线 B：先加工订单 1，再加工订单 4。
具体完工情况为：

生产线 A：

订单 3 在第 0∼2 小时加工，完工时刻为 2，满足 2≤d 
3
​
 =3；
订单 2 在第 2∼5 小时加工，完工时刻为 5，满足 5≤d 
2
​
 =5。
生产线 B：

订单 1 在第 0∼3 小时加工，完工时刻为 3，满足 3≤d 
1
​
 =4；
订单 4 在第 3∼7 小时加工，完工时刻为 7，满足 7≤d 
4
​
 =7。
四份订单均可按时完成，总收益为：

6+12+10+15=43
【样例说明 2】
五份订单的总加工时间为：

3+2+4+3+5=17
在最晚交付期限为 8 的情况下，两条生产线在时间区间 [0,8] 内总共最多只能提供 16 个单位的加工时间，因此不可能将全部订单都安排并按时完成。

一种最优方案是放弃订单 2，选择订单 {1,3,4,5}。安排如下：

生产线 A：先加工订单 3，再加工订单 4；
生产线 B：先加工订单 1，再加工订单 5。
对应的完工时刻分别为：

订单 3：完工时刻为 4，满足 4≤d 
3
​
 =6；
订单 4：完工时刻为 7，满足 7≤d 
4
​
 =7；
订单 1：完工时刻为 3，满足 3≤d 
1
​
 =4；
订单 5：完工时刻为 8，满足 8≤d 
5
​
 =8。
这四份订单均能按时完成，因此总收益为：

20+12+10+18=60
可以证明，不存在收益大于 60 的可行方案，因此答案为 60。

【评测用例规模与约定】
对于 30% 的评测用例，满足 N≤15；
对于 60% 的评测用例，满足 N≤50，且 d 
i
​
 ≤300；
对于所有的评测用例，1≤N≤200，1≤p 
i
​
 ≤50，p 
i
​
 ≤d 
i
​
 ≤1000，1≤r 
i
​
 ≤10000。 """

import sys
input = sys.stdin.buffer.readline
def read():
    return map(int,input().split())
n = int(input())
limit = 0
tasks = []
for _ in range(n):
    #持续时间，截止时间，获得的收益
    p,d,r = read()
    limit = max(limit,d)
    tasks.append((p,d,r))
tasks.sort(key=lambda task: task[1])
#dp[i][j][k]表示在A产线最终时间为j，B产线最终时间为k,处理前i个任务所能获得的最大收益
#假设第i个任务的持续时间、截止时间、获得的收益为为p\d\r
#dp[i][j][k] = max(dp[i-1][j][k],dp[i-1][j-p][k]+r,dp[i-1][j][k-p]+r

# dp[j][k]：两条产线用时恰好为 j、k 时的最大收益
# -1 表示不可达
dp = [[0] * (limit + 1) for _ in range(limit + 1)]
ans = 0
for p, d, r in tasks:
    for j in range(d, -1, -1):
        for k in range(d, -1, -1):
            # 当前订单放到 A 产线
            if j >= p:
                dp[j][k] = max(dp[j][k], dp[j-p][k] + r)

            # 当前订单放到 B 产线
            if k >= p:
                dp[j][k] = max(dp[j][k], dp[j][k-p] + r)

            ans = max(ans,dp[j][k])
print(ans)
