""" 题目描述
对于一个长度为 n 的字符串 s=s 
0
​
 s 
1
​
 ⋯s 
n−1
​
  来说，子串的定义是从中选出两个下标 l,r (0≤l≤r≤n−1)，这之间所有的字符组合起来的一个新的字符串：s 
′
 =s 
l
​
 s 
l+1
​
 ⋯s 
r
​
  就是其中一个子串。

现在给出一个只有数字字符 0∼9 组成的数字字符串，小蓝想要知道在其所有的子串中，有多少个子串是好串。一个子串是好串，当且仅当它满足以下两个条件之一：

单字符子串一定是好串，即当子串长度为 1 时，它总是好串；
长度大于 1 时，可以拆分为两个连续非递减子串： 一个串 p=p 
0
​
 p 
1
​
 ⋯p 
k−1
​
  为连续非递减子串是指，对于所有 1≤i<k，满足 p 
i
​
 =p 
i−1
​
  或 p 
i
​
 =p 
i−1
​
 +1。即数字串中的每一个数字，要么等于上一个数字，要么等于上一个数字加 1。例如 12233、456 是连续非递减子串。
输入格式
输入一行包含一个字符串 s。

输出格式
输出一行包含一个整数表示答案，即好串的数目。

输入输出样例
输入 #1复制

12258
输出 #1复制

12
输入 #2复制

97856
输出 #2复制

13
说明/提示
样例说明 1
长度为 1 的好串：1、2、2、5、8，共 5 个；
长度为 2 的好串：12、22、25、58，共 4 个；
长度为 3 的好串：122、225，共 2 个；
长度为 4 的好串：1225，共 1 个；
总计 5+4+2+1=12 个。

样例说明 2
长度为 1 的好串：9、7、8、5、6，共 5 个；
长度为 2 的好串：97、78、85、56，共 4 个；
长度为 3 的好串：978、785、856，共 3 个；
长度为 4 的好串：7856，共 1 个；
总计 5+4+3+1=13 个。

评测用例规模与约定
对于 20% 的评测用例，1≤n≤5；
对于 40% 的评测用例，1≤n≤20；
对于 60% 的评测用例，1≤n≤100；
对于 70% 的评测用例，1≤n≤10 
3
 ；
对于 80% 的评测用例，1≤n≤10 
4
 ；
对于所有评测用例，1≤n≤10 
5
 ，s 中只包含数字字符 0∼9。 """

s = input().strip()
n = len(s)
left = 0
bad_cnt = 0
ans = 0
for right in range(n):
    # 新增加 s[right-1] -> s[right] 这条边
    if right > 0:
        x = int(s[right - 1])
        y = int(s[right])

        if not (y == x or y == x + 1):
            bad_cnt += 1

    # 断点超过一个，缩小左边界
    while bad_cnt > 1:

        x = int(s[left])
        y = int(s[left + 1])

        if not (y == x or y == x + 1):
            bad_cnt -= 1

        left += 1

    # 所有以 right 结尾、起点 >= left 的子串都是好串
    ans += right - left + 1

print(ans)