""" 题目描述
中秋节到了，洛谷幼儿园的老师们准备给小朋友们分月饼。

幼儿园有 a 个大班学生，每个大班学生要吃  
3
1
​
  个月饼，还有 b 个中班学生，每个中班学生要吃  
4
1
​
  个月饼。

月饼可以被切分成任意大小，但老师只能准备完整的月饼。为了满足所有小朋友的需求，老师准备的月饼总量必须不少于所有小朋友想吃的月饼总量。

请你计算，老师最少需要准备多少个完整的月饼。

输入格式
输入一行，包含两个非负整数 a,b，分别表示大班学生和中班学生的人数。

输出格式
输出一个整数，表示最少需要准备的完整月饼数量。

输入输出样例
输入 #1复制

3 4
输出 #1复制

2
输入 #2复制

1 1
输出 #2复制

1
说明/提示
样例 1 解释
3 个大班学生一共需要 3× 
3
1
​
 =1 个月饼；4 个中班学生一共需要 4× 
4
1
​
 =1 个月饼。因此总共需要准备 2 个月饼。

样例 2 解释
所有小朋友一共需要  
3
1
​
 + 
4
1
​
 = 
12
7
​
  个月饼。

由于只能准备完整的月饼，因此最少需要准备 1 个月饼。

数据范围
本题共有 20 个测试点。

对于测试点 1∼4，a 是 3 的倍数；
对于测试点 5∼8，b 是 4 的倍数；
对于测试点 9,10，a=0；
对于测试点 11,12，b=0；
对于全部测试点，保证 0≤a,b≤1000； """
import sys
from fractions import Fraction
from math import ceil
input = sys.stdin.buffer.readline

def read():
    return map(int,input().split())

a,b = read()
n = Fraction(a,3) + Fraction(b,4)

print(ceil(n))