""" 题目描述
中秋节快到了，洛谷小镇准备举办一场热闹的中秋灯会。为了制作悬挂灯笼所需的支架，洛谷的工匠们需要从竹子上砍下若干段长度恰好为 z 的竹段。

竹林中有一排竹子，它们的长度均为整数，并且依次为：x,x+1,x+2,…,y。对于每一根竹子，工匠都可以从中砍出尽可能多的、长度恰好为 z 的竹段。每根竹子砍剩下的部分如果不足 z，则无法继续使用；不同竹子的剩余部分也不能拼接在一起。

请你计算，这一排竹子一共可以砍出多少段长度为 z 的竹段。

输入格式
输入一行，包含三个整数 x,y,z，分别表示最短竹子的长度、最长竹子的长度、以及每段竹段的长度要求。

输出格式
输出一个整数，表示所有竹子一共可以砍出的长度为 z 的竹段数量。

输入输出样例
输入 #1复制

3 7 2
输出 #1复制

11
输入 #2复制

1 5 10
输出 #2复制

0
说明/提示
样例 1 解释
这排竹子的长度依次为 3,4,5,6,7，分别可以砍出 1,2,2,3,3，共计 11 段竹子。

样例 2 解释
所有竹子的长度都小于 10，因此无法砍出任何长度为 10 的竹段。

数据范围
本题共有 20 个测试点。

对于测试点 1∼4，保证 x=y；
对于测试点 5∼8，保证 y−x≤10；
对于测试点 9∼16，保证 x,y,z≤1000；
对于全部测试点，保证 1≤x≤y≤2×10 
5
 ，1≤z≤2×10 
5
 。 """
import sys
input = sys.stdin.buffer.readline
def read():
    return map(int,input().split())

x,y,z = read()
arr = []
for i in range(x,y+1):
    arr.append(i)
ans = 0
for number in arr:
    ans += number//z
print(ans)