""" 题目描述
小青蛙住在一条河边，它想到河对岸的学校去学习。小青蛙打算经过河里的石头跳到对岸。

河里的石头排成了一条直线，小青蛙每次跳跃必须落在一块石头或者岸上。不过，每块石头有一个高度，每次小青蛙从一块石头起跳，这块石头的高度就会下降 1，当石头的高度下降到 0 时小青蛙不能再跳到这块石头上（某次跳跃后使石头高度下降到 0 是允许的）。

小青蛙一共需要去学校上 x 天课，所以它需要往返 x 次，即过河 2x 次。当小青蛙具有一个跳跃能力 y 时，它能跳不超过 y 的距离。

请问小青蛙的跳跃能力至少是多少才能用这些石头上完 x 次课。

输入格式
输入的第一行包含两个整数 n,x, 分别表示河的宽度和小青蛙需要去学校的天数。请注意 2x 才是实际过河的次数。

第二行包含 n−1 个非负整数 H 
1
​
 ,H 
2
​
 ,⋯,H 
n−1
​
 , 其中 H 
i
​
 >0 表示在河中与小青蛙的家相距 i 的地方有一块高度为 H 
i
​
  的石头，H 
i
​
 =0 表示这个位置没有石头。

输出格式
输出一行, 包含一个整数, 表示小青蛙需要的最低跳跃能力。

输入输出样例
输入 #1复制

5 1
1 0 1 0
输出 #1复制

4
说明/提示
【样例解释】

由于只有两块高度为 1 的石头，所以往返只能各用一块。第 1 块石头和对岸的距离为 4，如果小青蛙的跳跃能力为 3 则无法满足要求。所以小青蛙最少需要 4 的跳跃能力。

【评测用例规模与约定】

对于 30% 的评测用例，n≤100;

对于 60% 的评测用例，n≤1000;

对于所有评测用例，1≤n≤10 
5
 ，1≤x≤10 
9
 ，0≤H 
i
​
 ≤10 
4
 。

蓝桥杯 2022 省赛 A 组 F 题。 """
import sys
input = sys.stdin.buffer.readline
n, x = map(int, input().split())
h = [0] + list(map(int, input().split()))

# 前缀和
prefix = [0] * n
for i in range(1, n):
    prefix[i] = prefix[i - 1] + h[i]

def check(y):
    """
    跳跃能力为 y 时，
    能不能完成 2*x 次过河
    """
    # 检查所有连续 y 个位置
    for i in range(y, n):
        # 区间 [i-y+1, i]
        total = prefix[i] - prefix[i - y]
        if total < 2 * x:
            return False
    return True

# 找最小可行的 y
left = 1
right = n
while left < right:
    mid = (left + right) // 2
    if check(mid):
        right = mid
    else:
        left = mid + 1

print(left)