""" 题目描述
小蓝开发了一款名为“蓝桥大富翁”的游戏。游戏中共有 2026 名玩家，编号依次为 1 至 2026。

游戏开始时，每名玩家都拥有一定的初始积分。其中，编号为 i 的玩家初始积分为 i。

游戏会进行多轮积分更替。每轮更替时，所有玩家的积分会同时更新：对于某名玩家，其新积分等于本轮更替前，除自己以外其余所有玩家积分的乘积。以 3 名玩家且初始积分分别为 1,2,3 的情况为例。首轮更替时：

1 号玩家的新积分为 2×3=6;
2 号玩家的新积分为 1×3=3;
3 号玩家的新积分为 1×2=2。
因此，首轮更替结束后，三名玩家的积分变为 6,3,2。

现在，请你计算，在第 2026 轮更替结束后，全场 2026 名玩家积分的总乘积对 998244353 取模后的数值。

输入格式
无

输出格式
这是一道结果填空题，你只需要算出结果后提交即可。本题的结果为一个整数，在提交答案时只需编写一个程序输出这个整数，填写多余的内容将无法得分。

输入输出样例 """
#\[
#\boxed{P=(2026!)^{2025^{2026}}}
#\]
from math import factorial

def solve():
    n = 2026
    MOD = 998244353
    f = factorial(n) % MOD
    k = pow(2025, 2026)
    ans = pow(f, k, MOD)
    print(ans)
solve()