""" 题目描述
小蓝发现了一个有趣的数列, 这个数列的前几项如下:

1,1,2,1,2,3,1,2,3,4,…

小蓝发现, 这个数列前 1 项是整数 1 , 接下来 2 项是整数 1 至 2 , 接下来 3 项是整数 1 至 3 , 接下来 4 项是整数 1 至 4 , 依次类推。

小蓝想知道, 这个数列中, 连续一段的和是多少。

输入格式
输入的第一行包含一个整数 T, 表示询问的个数。

接下来 T 行, 每行包含一组询问, 其中第 i 行包含两个整数 l 
i
​
  和 r 
i
​
 , 表示 询问数列中第 l 
i
​
  个数到第 r 
i
​
  个数的和。

输出格式
输出 T 行, 每行包含一个整数表示对应询问的答案。

输入输出样例
输入 #1复制

3
1 1
1 3
5 8
输出 #1复制

1
4
8
说明/提示
对于 10% 的评测用例, 1≤T≤30,1≤l 
i
​
 ≤r 
i
​
 ≤100 。

对于 20% 的评测用例, 1≤T≤100,1≤l 
i
​
 ≤r 
i
​
 ≤1000 。

对于 40% 的评测用例, 1≤T≤1000,1≤l 
i
​
 ≤r 
i
​
 ≤10 
6
  。

对于 70% 的评测用例, 1≤T≤10000,1≤l 
i
​
 ≤r 
i
​
 ≤10 
9
  。

对于 80% 的评测用例, 1≤T≤1000,1≤l 
i
​
 ≤r 
i
​
 ≤10 
12
  。

对于 90% 的评测用例, 1≤T≤10000,1≤l 
i
​
 ≤r 
i
​
 ≤10 
12
  。

对于所有评测用例, 1≤T≤100000,1≤l 
i
​
 ≤r 
i
​
 ≤10 
12
  。

蓝桥杯 2021 国赛 A 组 E 题（B 组 F 题，C 组 F 题）。 """

import sys
from math import isqrt

input = sys.stdin.buffer.readline

def prefix_sum(x):
    #找出最大的k使得，前k整段的数字个数小于等于x
    #前k段一共有comb(k,2)个数字，最后一个数字是k
    #第k+1段一共有k+1个数字，最后一个数字是k+1
    #前k段所有数字的总和为k * (k + 1) * (k + 2) // 6
    #最后剩余q个数字
    #这q个数字的总和为q * (q + 1) // 2
    k = (isqrt(8 * x + 1) - 1) // 2
    q = x - k * (k + 1) // 2
    return k * (k + 1) * (k + 2) // 6 + q * (q + 1) // 2

t = int(input())
ans = []

for _ in range(t):
    l, r = map(int, input().split())
    ans.append(str(prefix_sum(r) - prefix_sum(l - 1)))

sys.stdout.write("\n".join(ans))